// Name: Greek
// Icon: gr.png
{
    // Lower case letters:
    // -------------------
    "a": "α",
    "b": "β",
    // No c
    "d": "δ",
    "e": "ε",
    // No f
    "g": "γ",
    // No h
    "i": "ι",
    // No j
    "k": "κ",
    "l": "λ",
    "m": "μ",
    "n": "ν",
    "o": "ο",
    "p": "π",
    // No q
    "r": "ρ",
    "s": "σ",
    "t": "τ",
    "u": "υ",
    // No v
    "w": "ω",
    "x": "χ",
    // No y
    "z": "ζ",
    // Compound letters:
    "πc": "ψ",
    "πC": "ψ",
    "κc": "ξ",
    "κC": "ξ",
    "πh": "φ",
    "πH": "φ",
    "τh": "θ",
    "τH": "θ",
    // Accented letters:
    "è": "η",
    // Upper case letters:
    // -------------------
    "A": "Α",
    "B": "Β",
    // No c
    "D": "Δ",
    "E": "Ε",
    // No f
    "G": "Γ",
    // No h
    "I": "Ι",
    // No j
    "K": "Κ",
    "L": "Λ",
    "M": "Μ",
    "N": "Ν",
    "O": "Ο",
    "P": "Π",
    // No q
    "R": "Ρ",
    "S": "Σ",
    "T": "Τ",
    "U": "Υ",
    // No v
    "W": "Ω",
    "X": "Χ",
    // No y
    "Z": "Ζ",
    // Compound letters:
    "ΠC": "Ψ",
    "Πc": "Ψ",
    "ΚC": "Ξ",
    "Κc": "Ξ",
    "ΠH": "Φ",
    "Πh": "Φ",
    "ΤH": "Θ",
    "Τh": "Θ",
    // Accented letters:
    "È": "Η",
}
