// Name: Russian
// Icon: ru.png
{
    // Lower case letters:
    // -------------------
    "a":   "а",
    "b":   "б",
    "c":   "с",
    "d":   "д",
    "e":   "е",
    "f":   "ф",
    "g":   "г",
    // No h
    "i":   "и",
    "j":   "ж",
    "k":   "к",
    "l":   "л",
    "m":   "м",
    "n":   "н",
    "o":   "о",
    "p":   "п",
    // No q
    "r":   "р",
    // No s
    "t":   "т",
    "u":   "у",
    "v":   "в",
    // No w
    "x":   "х",
    // No y
    "z":   "з",
    // Soft vovels:
    "ya":  "я",
    "yA":  "я",
    "yi":  "й",
    "yI":  "й",
    "yo":  "ё",
    "yO":  "ё",
    "yu":  "ю",
    "yU":  "ю",
    "yy":  "ы",
    "yY":  "ы",
    // Compound letters:
    "тs":  "ц",
    "тS":  "ц",
    "sh":  "ш",
    "sH":  "ш",
    "сh":  "ч",
    "сH":  "ч",
    "шсh": "щ",
    "шсH": "щ",
    "шСh": "щ",
    "шСH": "щ",
    // Signs:
    "qd":  "ъ",
    "qD":  "ъ",
    "qs":  "ь",
    "qS":  "ь",
    // Accented letters:
    "è":   "э",

    // Upper case letters:
    // -------------------
    "A":   "А",
    "B":   "Б",
    "C":   "С",
    "D":   "Д",
    "E":   "Е",
    "F":   "Ф",
    "G":   "Г",
    // No H
    "I":   "И",
    "J":   "Ж",
    "K":   "К",
    "L":   "Л",
    "M":   "М",
    "N":   "Н",
    "O":   "О",
    "P":   "П",
    // No Q
    "R":   "Р",
    // No S
    "T":   "Т",
    "U":   "У",
    "V":   "В",
    // No W
    "X":   "Х",
    // No Y
    "Z":   "З",
    // Soft vovels:
    "YA":  "Я",
    "Ya":  "Я",
    "YI":  "Й",
    "Yi":  "Й",
    "YO":  "Ё",
    "Yo":  "Ё",
    "YU":  "Ю",
    "Yu":  "Ю",
    "YY":  "Ы",
    "Yy":  "Ы",
    // Compound letters:
    "ТS":  "Ц",
    "Тs":  "Ц",
    "SH":  "Ш",
    "Sh":  "Ш",
    "СH":  "Ч",
    "Сh":  "Ч",
    "ШСH": "Щ",
    "ШСh": "Щ",
    "ШсH": "Щ",
    "Шсh": "Щ",
    // Signs:
    "QD":  "Ъ",
    "Qd":  "Ъ",
    "QS":  "Ь",
    "Qs":  "Ь",
    // Accented letters:
    "È":   "Э",
}
